// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// System.Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// int thirdNumber = 0;

// if (number.Length > 2)
// {
//     System.Console.WriteLine($"Третья цифра числа {number} = {number[2]}");
// }
// else
// {
//     System.Console.WriteLine("Третьей цифры нет");
// }


// if (number > 99)
// {
//     while (number > 99)
//     {
//         thirdNumber = number % 10;
//         number = number / 10;
//     }
//     System.Console.WriteLine($"Третья цифра числа {thirdNumber}");
// }
// else {
//     System.Console.WriteLine("Третьей цифры нет");
// }
